Figure/Figure 3/data/kw/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          20;
        startFace       2671;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       2691;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          69;
        startFace       2711;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          69;
        startFace       2780;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2760;
        startFace       2849;
    }
)

// ************************************************************************* //
