Figure/Figure 3/data/kw/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform  1e-10;
// internalField   uniform 0.0150; //Calculated

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    
    outlet
    {
        type            cyclic;
    }
    
    top 
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            kqRWallFunction;
        value           $internalField;    

    }

    "(front|back)"
    {
        type            empty;
  
    }
}
// ************************************************************************* //
